Revit 2026 API

# FilledRegionTypeBackgroundPatternColor Property

---

The background fill pattern color.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Color BackgroundPatternColor { get; set; }
```
```vb
Public Property BackgroundPatternColor As Color
	Get
	Set
```
```cpp
public:
property Color^ BackgroundPatternColor {
	Color^ get ();
	void set (Color^ value);
}
```
```fsharp
member BackgroundPatternColor : Color with get, set
```

#### Property Value

Color

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

FilledRegionType Class

Autodesk.Revit.DB Namespace